Autodesk.Revit.DB.Element.DisplayLockOnlyWhenElementIsSelected(Autodesk.Revit.DB.View)
In some cases, the current selection set is augmented and locks are displayed for the additional elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Element.DeleteEntity(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Deletes the existing entity created by %schema% in the element
schema:
Schema used for creation of the entity
Returns:
True if entity was deleted, false if entity didn't exist
Throws Autodesk.Revit.Exceptions.ArgumentException:
Writing of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Element.SetEntity(Autodesk.Revit.DB.ExtensibleStorage.Entity)
Stores the entity in the element. If an Entity described by the same Schema already
exists, it is overwritten.
entity:
The Entity to be stored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Writing of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Element.GetEntity(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Returns the existing entity corresponding to the Schema if it has been saved in the
Element, or an invalid entity otherwise.
Remarks:
The Entity that is returned is a copy of the stored data (with copy-on-write
optimization). Modifying it is allowed (even with restricted write), but to save your
changes you must call SetEntity.
schema:
The Schema describing the Entity.
Returns:
The returned Entity.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Reading of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Element.GetEntitySchemaGuids
Returns the Schema guids of any Entities stored in this element.
Returns:
The schema Entity guids.
Since:
2014

Autodesk.Revit.DB.Element.IsPhaseDemolishedValid(Autodesk.Revit.DB.ElementId)
Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
Remarks:
Acts as a validator for setting the property DemolishedPhaseId.
demolishedPhaseId:
The id of a Phase or invalidElementId.
Returns:
True if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Element.IsPhaseCreatedValid(Autodesk.Revit.DB.ElementId)
Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
Remarks:
Acts as a validator for setting the property CreatedPhaseId.
createdPhaseId:
The id of a Phase.
Returns:
True if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Element.ArePhasesModifiable
Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
Remarks:
Acts as a validator for setting the properties CreatedPhaseId and DemolishedPhaseId.
Returns:
True if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element, false otherwise.
Since:
2013

Autodesk.Revit.DB.Element.HasPhases
Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
Remarks:
Acts as a validator for setting the properties CreatedPhaseId and DemolishedPhaseId.
Returns:
True if this Element has the properties CreatedPhaseId and DemolishedPhaseId, false otherwise.
Since:
2013

Autodesk.Revit.DB.Element.GetMonitoredLocalElementIds
Provides the local element IDs when the element is monitoring.
Returns:
The IDs of local element IDs being monitored by this element.
Since:
2011

Autodesk.Revit.DB.Element.GetMonitoredLinkElementIds
Provides the link instance IDs when the element is monitoring.
Returns:
The IDs of linked instances.
Since:
2011

Autodesk.Revit.DB.Element.IsMonitoringLocalElement
Indicate whether an element is monitoring other local elements.
Returns:
True if this element is monitoring other elements in same project. Otherwise, false will be returned.
Since:
2011

Autodesk.Revit.DB.Element.IsMonitoringLinkElement
Indicate whether an element is monitoring any elements in any linked models.
Returns:
True if this element is monitoring elements in a linked models. Otherwise, false will be returned.
Since:
2011

Autodesk.Revit.DB.Element.GetAnalyticalModelId
Retrieves the Element Id of the Analytical Model Element for this Element.
Remarks:
If the Element does not have an Analytical Model, the returned value
will be invalidElementId.  This may occur even if the Element can have an Analytical Model,
but does not for some reason.
Returns:
Element Id.

Autodesk.Revit.DB.Element.GetAnalyticalModel
Retrieves writeable Analytical Model for Element.
Remarks:
If the Element does not have an Analytical Model, the returned value
will be NULL.  This may occur even if the Element can have an Analytical Model,
but does not for some reason.
Returns:
Writeable Analytical Model.
Since:
2011

Autodesk.Revit.DB.Element.CanHaveAnalyticalModel
Indicates whether the Element can have an Analytical Model.
Returns:
True if the Element can have an Analytical Model, false otherwise.
Since:
2011

Autodesk.Revit.DB.Element.GetChangeTypeAny
Returns ChangeType associated with any change in an element.
Remarks:
Use this change type to trigger an Updater when elements change in any way.
For maximum efficiency, we recommend the use of ChangeTypeParameter and
ChangeTypeGeometry, if applicable, instead.
Caution: Changes to an element by an Updater using this trigger will result
in re-triggering of the Updater. For example, Updater1 triggers on
ChangeTypeAny on Element X. A Revit user modifies parameter A of X.
Updater1 is triggered and modifies X's parameter B. The change in parameter B,
triggers another call to Updater1.Execute(). If Updater1 continues to
modify X, it can run into an infinite loop. Infinite loops are detected by
Revit and result in the Updater being disabled.
Note: This change type will not trigger on newly created or deleted elements or on changes caused by Undo and Redo.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on any change in an element.

Autodesk.Revit.DB.Element.GetChangeTypeGeometry
Returns ChangeType associated with a change in the geometry of an element
Remarks:
Use this change type to trigger an Updater when the geometry of an element
changes. Only physical changes to shape of the element(s) will trigger the
updater. For example, changes like cutting a hole in a wall or
adjusting its height are considered to be geometric changes. However,
moving a wall to a different location without modifying its shape
is not considered to be a change in geometry and will not trigger the Updater.
Note: This change type will not trigger on newly created or deleted elements or on changes caused by Undo and Redo.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on a geometry change in an element

Autodesk.Revit.DB.Element.GetChangeTypeParameter(Autodesk.Revit.DB.ElementId)
Returns ChangeType associated with a change in a parameter's value
Remarks:
remarks: Use this change type to trigger an Updater when the value of an element's
parameter changes.
Note: This change type will not trigger on newly created or deleted elements or on changes caused by Undo and Redo.
parameterId:
ElementId of parameter for the ChangeType to trigger on.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on parameter value change.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Element.GetChangeTypeElementAddition
Returns ChangeType associated with element addition
Remarks:
Use this change type to trigger an Updater on the addition of elements
to a document.
Note: This change type will not trigger on changes caused by Undo and Redo.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on element addition.

Autodesk.Revit.DB.Element.GetChangeTypeElementDeletion
Returns ChangeType associated with element deletion.
Remarks:
ChangeType that can be used to define a trigger for an Updater,
Use this change type to trigger an Updater on the deletion of elements from a document.
Note: This change type will not trigger on changes caused by Undo and Redo.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on element deletion.

Autodesk.Revit.DB.Element.GetParameterFormatOptions(Autodesk.Revit.DB.ElementId)
Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
parameterId:
Id of parameter for which FormatOptions will be returned.
Returns:
Format options of element parameter. If the UseDefault property is true, then no formatting overrides have been defined in the element for the specified parameter, and the FormatOptions for the parameter should be obtained from the Unit object, which can be obtained from the Document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Element.GetMaterialVolume(Autodesk.Revit.DB.ElementId)
Gets the volume of the material with the given id.
materialId:
The material id returned from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean).
Returns:
The volume of the material for this element.  Returns 0.0 if the material is not a part of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
materialId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Element.GetMaterialArea(Autodesk.Revit.DB.ElementId,System.Boolean)
Gets the area of the material with the given id.
materialId:
The material id returned from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean).
usePaintMaterial:
If true, this material id was returned as a paint material from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean) and the area returned should be calculated from paint applied to the element.
If false, this material id was returned as a non-paint element material from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean) and the area is calculated from the element geometry and layers.
Returns:
The area of the material for this element.  Returns 0.0 if the material id is not a part of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
materialId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element element does not support paint material assignment.
Since:
2014

Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean)
Gets the element ids of all materials present in the element.
Remarks:
The returned collection of materials will be empty in any of the following situations:
The returnPaintMaterials flag is false, and the Category.HasMaterialQuantities property of the element's Category is false.The returnPaintMaterials flag is true, and the the element does not have any painted faces.
Any material ids returned by this method can be used in GetMaterialArea() to get the calculated area associated to the material.
Non-paint materials ids returned by this method can be used in GetMaterialVolume() to get the volume associated to the material.
returnPaintMaterials:
If true, this returns material ids assigned to element faces by the Paint tools.  If false, this returns ids associated to the material through
its geometry or compound structure layers.
Returns:
The set of material ids.
Since:
2014

Autodesk.Revit.DB.Element.GetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceType)
Gets the ExternalResourceReference associated with a specified external resource type.
resourceType:
The desired external resource type.
Returns:
The copy of the ExternalResourceReference associated with a specified external resource type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Element does not use a resource reference for the specified resource type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Element.RefersToExternalResourceReference(Autodesk.Revit.DB.ExternalResourceType)
Determines whether this Element uses external resources associated with
a specified external resource type.
resourceType:
The desired external resource type.
Returns:
Returns true if this Element uses external resources associated with
the specified external resource type; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Element.GetExternalResourceReferences
Gets the full map of the external resource references referenced
by the element.
Returns:
The full map of the external resource references referenced by the element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element does not use any external resource.
Since:
2015

Autodesk.Revit.DB.Element.RefersToExternalResourceReferences
Determines whether this Element uses external resources.
Remarks:
Some elements may contain references to data from external resources.
These elements contain one or more ExternalResourceReferences.
Returns:
True if this element uses external resources, false if it does not.
Since:
2015

Autodesk.Revit.DB.Element.GetExternalFileReference
Gets information pertaining to the external file referenced
by the element.
Returns:
An object containing path and type information for the external
file referenced by the element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element does not represent an external file.
Since:
2012

Autodesk.Revit.DB.Element.IsExternalFileReference
Determines whether this Element represents an external
file.
Remarks:
Linked files are references to external files, but
imported files are not, as their data is brought wholly into
Revit.
Returns:
True if this element contains information about some external
file, false if it does not.
Since:
2012

Autodesk.Revit.DB.Element.GetGeometryObjectFromReference(Autodesk.Revit.DB.Reference)
Retrieve one geometric primitive contained in the element given a reference.
Remarks:
It will return the last geometric object in the path.
null will be returned if related geometric object could not be found in the model.
reference:
The geometric object referenced by this instance will be retrieved from the model.
Returns:
The geometric object referenced by the input reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id of this element is not same as that referenced by reference
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element id held by the input reference is not same as the id of this element.
The geometric information could not be taken for this element.
Since:
2012

Autodesk.Revit.DB.Element.GetDependentElements(Autodesk.Revit.DB.ElementFilter)
Get all elements that, from a logical point of view, are the children of this Element.
Remarks:
The elements that this method will return:
Will be deleted if the input Element is deleted.Potentially could report the input Element as a host (there could be other type of
parent/child relationship here: for example view/view-specific elements, etc.)
filter:
What type of elements we are interested of.
Can be NULL to return all dependent elements.
Returns:
Logical children of this element
Since:
2018.1

Autodesk.Revit.DB.Element.CanDeleteSubelement(Autodesk.Revit.DB.Subelement)
Checks if given subelement can be removed from the element.
subelem:
Subelement to check.
Returns:
True if subelement can be removed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Element.DeleteSubelements(System.Collections.Generic.IList{Autodesk.Revit.DB.Subelement})
Removes the subelements from the element.
Remarks:
Depending on implementation for given element as the result, the element
can be deleted - especially if after Subelement deletion there are no Subelement left.
subelems:
Subelements to delete.
Returns:
True if entire element was deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more subelements in subelems do not exist in the element.
-or-
One or more of the subelements subelems cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Element.DeleteSubelement(Autodesk.Revit.DB.Subelement)
Removes a subelement from the element.
Remarks:
Depending on implementation for given element as the result, the element
can be deleted - especially if after subelement deletion there are no subelements left.
subelem:
The subelement to delete.
Returns:
True if entire element was deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The subelement subelem does not exist in the element.
-or-
Subelement subelem cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Element.GetSubelements
Returns the collection of element subelements.
Remarks:
This collection will not include the Element itself.
Returns:
The collection of element subelements.
Since:
2018

Autodesk.Revit.DB.Element.ChangeTypeId(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Changes the type of all elements in the given set.
Remarks:
In some cases, applying a change in type will result in a new element being created.
The only active examples of this are when applying a normal wall type to a curtain panel, or
converting such a wall back to a curtain panel.
Then return map would have (original element id, new element id) pair(s).
Note: this function needs an open transaction.
Note: this function calls regeneration.
document:
The document.
elementIds:
A collection of element IDs.
typeId:
Identifier of the type to assign to this element.
Returns:
The map of original element IDs to the new element IDs
if some elements were replaced by new elements
(the map is empty if no elements were replaced)
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one of the elements in elementIds does not exist in the document
-or-
Not all elements elementIds can have a type assigned.
-or-
The type typeId is not valid for at least one of the elements in elementIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
One or more elements in elementIds is a member of a loaded family.
-or-
One or more elements in elementIds is a member of a group type that is
not being edited.
Since:
2011

Autodesk.Revit.DB.Element.GetValidTypes(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Obtains a set of types that are valid for all given elements.
document:
The document.
elementIds:
A collection of element IDs.
Returns:
A set of element IDs of types that are valid for these elements or an empty set if any element cannot have a type assigned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Element.IsValidType(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Checks if given type is valid for the set of elements.
Remarks:
A type is valid for the set of elements if it is valid for each and every element in the set.
document:
The document.
elementIds:
A collection of element IDs.
typeId:
ElementId of the type to check.
Returns:
True if all elements can have a type assigned and this type is valid for all elements, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Element.CanHaveTypeAssigned(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Checks if all elements in the set can have a type assigned.
document:
The document.
elementIds:
A collection of element IDs.
Returns:
True if all elements in the set can have a type assigned, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Element.ChangeTypeId(Autodesk.Revit.DB.ElementId)
Changes the type of the element.
Remarks:
In rare cases, applying a change in type will result in a new element being created.
The only active examples of this are when applying a normal wall type to a curtain panel, or
converting such a wall back to a curtain panel.
In this situation the new element id is returned.
Also, this element becomes invalid.
typeId:
Identifier of the type to assign to this element.
Returns:
The new element id if new element is created, or InvalidElementId if the element's type changed without creating a new element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type typeId is not valid for this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element cannot have type assigned.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2011

Autodesk.Revit.DB.Element.GetValidTypes
Obtains a set of types that are valid for this element.
Returns:
A set of element IDs of types that are valid for this element or an empty set if element cannot have type assigned.
Since:
2011

Autodesk.Revit.DB.Element.IsValidType(Autodesk.Revit.DB.ElementId)
Checks if given type is valid for this element.
Remarks:
A type is valid for an element if it can be assigned to the element.
typeId:
ElementId of the type to check.
Returns:
True if element can have a type assigned and this type is valid for this element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Element.CanHaveTypeAssigned
Identifies if the element can have a type assigned.
Remarks:
Some elements cannot have type assigned,
in which case invalid element id is considered to be their type id.
Returns:
True if element can have a type assigned, false otherwise.
Since:
2011

Autodesk.Revit.DB.Element.GetGeneratingElementIds(Autodesk.Revit.DB.GeometryObject)
Returns the ids of the element(s) that generated the input geometry object.
Remarks:
This function supports many different types of relationships among elements.
Most of these relationships will return a single element, for example:
Window and door cutting wallsOpenings cutting hostsFace splitting facesWall sweep or reveal traversing wall
A few relationships have the potential for returning multiple elements, including:
Walls joining to other wall(s)Elements extending to roof(s)
If more than one id is returned, one of them (unspecified) is the id of the element that generated the geometry object and the others are ids of related elements. For example, if a wall A is joined to two walls B and C in a way that creates two end faces, and if this function is called for one of the two end faces, it will return the ids of walls B and C.
geometryObject:
The geometry object whose generating element is requested.
Returns:
The id(s) of the element(s) that generated (or may have generated) the given geometry object.  Empty if no generating elements are found. If the set contains just one id, it is the id of the element that generated the geometry object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input geometryObject is invalid and so cannot be used to obtain the generating element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Element.GetTypeId
Returns the identifier of this element's type.
Remarks:
Some elements cannot have type assigned,
in which case this method returns invalid element id.
Returns:
The id of the element's type, or invalid element id if the element cannot have type assigned.
Since:
2011

Autodesk.Revit.DB.Element.GetPhaseStatus(Autodesk.Revit.DB.ElementId)
Gets the status of a given element in the input phase
phaseId:
Id of the phase.
Returns:
The status of the element in the phase.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id does not represent a valid phase.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Element.CanBeLocked
Identifies if the element can be locked.
Returns:
True if the element can be locked, false otherwise.
Since:
2014

Autodesk.Revit.DB.Element.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Element.DemolishedPhaseId
Id of a Phase at which the Element was demolished.
Remarks:
After setting the property DemolishedPhaseId regeneration can fail if CreatedPhaseId and DemolishedPhaseId
are out of order, i.e. their index in the property Document.Phases.
Can be set to invalid element id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element does not allow setting the property DemolishedPhaseId to the value of demolishedPhaseId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The element does not have properties CreatedPhaseId and DemolishedPhaseId.
-or-
When setting this property: The element does not allow setting the properties CreatedPhaseId and DemolishedPhaseId.
Since:
2013

Autodesk.Revit.DB.Element.CreatedPhaseId
Id of a Phase at which the Element was created.
Remarks:
After setting the property CreatedPhaseId regeneration can fail if CreatedPhaseId and DemolishedPhaseId
are out of order, i.e. their index in the property Document.Phases.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element does not allow setting the property CreatedPhaseId to the value of createdPhaseId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The element does not have properties CreatedPhaseId and DemolishedPhaseId.
-or-
When setting this property: The element does not allow setting the properties CreatedPhaseId and DemolishedPhaseId.
Since:
2013

Autodesk.Revit.DB.Element.OwnerViewId
The id of the view that owns the element.

Autodesk.Revit.DB.Element.ViewSpecific
Identifies if the element is owned by a view.

Autodesk.Revit.DB.Element.AssemblyInstanceId
The id of the assembly instance to which the element belongs.

Autodesk.Revit.DB.Element.LevelId
The id of the level associated with the element.
Since:
2014

Autodesk.Revit.DB.Element.UniqueId
A stable unique identifier for an element within the document.
Remarks:
The UniqueId can be used to store an identifier in an external database and to retrieve the same element in the future if it still exists.
This id can be passed to the Document's Element property to retrieve the element. The UniqueId is stable across upgrades and workset
operations such as Save To Central, while the Autodesk.Revit.DB.ElementId property may change.

Autodesk.Revit.DB.Element.IsTransient
Indicates whether an element is transient or permanent.
Remarks:
Transient elements are usually created for short term use. This type of element can be created via Document.MakeTransientElements().
Transient and Permanent elements are not allowed to reference each other. A transient element can only refer to other transient elements in the same document.
Transient elements also cannot be selected or scheduled, and will not be saved when the document is saved, and will be discarded when the document is closed.
Modifying a transient element does not require a transaction, because such elements are not part of the model. As an effect of this, however, creation and modification of transients cannot be undone.
Because transient elements are technically not part of the model, they will not be found when using standard element filters, or in any collection of elements Revit returns, such as elements reported in dynamic updaters, etc.
Since:
2016

Autodesk.Revit.DB.Element.Id
A unique identifier for an Element in an Autodesk Revit project.
Remarks:
Returns an object containing the project-wide unique identifier for this Element. The identifier with this id is only unique for the project, it is not unique across separate Autodesk Revit projects.

Autodesk.Revit.DB.Element.GroupId
The id of the group to which an element belongs.
Since:
2014

Autodesk.Revit.DB.Element.WorksetId
Get Id of the Workset which owns the element.
Remarks:
Each element belongs to one and only one workset.

Autodesk.Revit.DB.Element.Pinned
Identifies if the element has been pinned to prevent changes.
Remarks:
An element which is pinned may not be moved, and warnings will be issued
when an attempt is made to delete it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Element cannot be pinned or unpinned.

Autodesk.Revit.DB.Element.LookupParameter(System.String)
Attempts to find a parameter on the element which has the given name.
name: The name of the parameter to be retrieved.
Returns: The matching parameter. This return may be null if there is no matching parameter. If there are multiple matching parameters the first one found is returned.
Remarks:
This method will attempt to find a parameter on this Element whose name matches the input. The possible results include:
A single matching parameter is found: it will be returned.No matching parameter is found: null is returned.Multiple matching parameters exist. In this situation the first one encountered will be returned. This match is determined at random and may change in the future..
Multiple matches of parameters with the same name can occur because shared parameters or project parameters can be bound to an element category even if there is a built-in parameter with the same name already.  If this method is used to find built-in parameters the code will not be portable to other languages of Revit (because built-in parameter names are translated, and this method matches the translation). For the reasons above this method should be used sparingly and only when you have a reasonable expectation that only one parameter exists with the given name, and when portability across multiple languages is not a requirement.Safer approaches include:Autodesk.Revit.DB.Element.GetParameters(System.String) to get all the matches with the given name.Autodesk.Revit.DB.Element.get_Parameter(System.Guid) to get a shared parameter by stored guid.Autodesk.Revit.DB.Element.get_Parameter(Autodesk.Revit.DB.BuiltInParameter) to find a built-in parameter in a language-independent way.
Since: 2015

Autodesk.Revit.DB.Element.GetParameters(System.String)
Retrieves the parameters from the element via the given name.
name: The name of the parameter to be retrieved.
Returns:
A collection containing the parameters having the same given parameter name.
Remarks:
Multiple matches of parameters with the same name can occur because shared parameters or project parameters can be bound to an element category even if there is a built-in parameter with the same name already.
If this method is used to find built-in parameters the code will not be portable to other languages of Revit (because built-in parameter names are translated, and this method matches the translation).
For the reasons above this method should be used sparingly and when portability across multiple languages is not a requirement.
Safer approaches include:
Autodesk.Revit.DB.Element.get_Parameter(System.Guid) to get a shared parameter by stored guid.
Autodesk.Revit.DB.Element.get_Parameter(Autodesk.Revit.DB.BuiltInParameter) to find a built-in parameter in a language-independent way.
Since: 2015

Autodesk.Revit.DB.Element.GetOrderedParameters
Gets the parameters associated to the element in order.
Returns:
A collection containing all parameters.
Remarks:
The collection consists of only visible parameters associated to the element; it returns a different list than Element.Parameters.
The parameters are returned in the order in which they appear in the Revit UI within a given group;
however, parameters of different groups may be mixed within this output.
Currently the Revit UI order is determined first by group and next by the order of the individual parameters.
Since: 2015

Autodesk.Revit.DB.Element.GetChangeTypeParameter(Autodesk.Revit.DB.Parameter)
Returns ChangeType associated with a change in a parameter's value
Remarks:
Use this change type to trigger an Updater when the value of an element's parameter changes.
Note: This change type will not trigger on newly created or deleted elements.
param:
Parameter for the ChangeType to trigger on
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on parameter value change
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Element.CanBeHidden(Autodesk.Revit.DB.View)
Indicates if the element can be hidden in the view.
Remarks: See discussion for some types of elements which may not be hidden.
Returns: If the element is not permitted to be hidden, false is returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.

Autodesk.Revit.DB.Element.IsHidden(Autodesk.Revit.DB.View)
Identifies if the element has been permanently hidden in the view.
Remarks: This does not determine if the element is hidden as a result of temporary hide/isolate,
view sectioning, view crop box, or other operations that can cause elements not to be visible.
To hide or unhide an element, use the Hide() and Unhide() method of Autodesk.Revit.DB.View.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.

Autodesk.Revit.DB.Element.BoundingBox(Autodesk.Revit.DB.View)
Retrieves a box that circumscribes all geometry of the element.
Remarks: Pass in a view to query view-specific (e.g., cut) geometry or null for model
geometry. If the view box is not known or cannot be calculated, this will return the model box;
if the model box is not known,
this will return null. The box will always be aligned to the default axes of the
model coordinate system (thus no rotation should be applied to the return value).
Also note that this bounding box volume
may enclose geometry that is not obvious. For example, the "flip controls" that
could be part of a family will be included in the computation of the bounding box even
though they are not always visible in the family instance of the family.

Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options)
Retrieves the geometric representation of the element.
options: User preferences for parsing of geometry.
Remarks:
This call will retrieve 3d representation of the element. null will be returned
for symbols, annotations or details. This involves extensive parsing or Revit's data
structures, so try to minimize calls if performance is critical.
Geometry objects provided from this method are obtained directly from the element. When
the element is changed for any reason, the geometry will be recalculated by Revit and geometry
objects obtained before the change are likely to no longer be valid.  If you need to preserve
geometry information obtained an element even after changes to that element, you should copy
the geometry objects or save the properties independently.
Although the geometry obtained from this method comes directly from the element, any attempt to modify
any of the geometry objects will operate only on a disconnected copy of the original geometry object from the element.
The modification will not affect the geometry of the original element from which it was obtained -
to change the geometry of the element you must use methods that directly affect the geometry calculated or
stored by Revit for this element.
If you require that the geometry items obtained contain valid
Reference objects, be sure to set the ComputeReferences
property of the Options.
An object that provides access to the geometry of the element.

Autodesk.Revit.DB.Element.DesignOption
Returns the design option to which the element belongs.
Remarks: If the element is not in a design option, i.e. in the main model, then this property will
return null.

Autodesk.Revit.DB.Element.Document
Returns the Document in which the Element resides.
Remarks: All elements are contained within a document. An element can be retrieved from this
document by using the id that is returned by the element's id property.

Autodesk.Revit.DB.Element.Location
This property is used to find the physical location of an element within a project.
Remarks: The Location property returns an object that can be used to find the location of an object
within the project. An object may have a point location, such as a table or may have a line location.
A wall is an example of an element that has a line location.

Autodesk.Revit.DB.Element.ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
Remarks: The Parameters can be rapidly accessed by parameter name as a key.
These parameters are displayed in the Element properties dialog in the Autodesk Revit interface.
These parameters can be retrieved and set via the parameter objects stored in this map.

Autodesk.Revit.DB.Element.Parameters
Retrieves a set containing all of the parameters that are contained within the element.
Remarks: The Parameters property contains a set of all the parameters that the element supports.
These parameters are displayed in the Element properties dialog in the Autodesk Revit interface.
These parameters can be retrieved and set via the parameter objects stored in this set.

Autodesk.Revit.DB.Element.Parameter(Autodesk.Revit.DB.BuiltInParameter)
Retrieves a parameter from the element given a parameter id.
parameterId: The built in parameter id of the parameter to be retrieved.
Remarks: Parameters are a generic form of data storage within elements. The parameters are visible
through the Autodesk Revit user interface in the Element Properties dialog. This method uses a
built in parameter id to access the parameter. Autodesk Revit has a large number of built in
parameters that are available via an enumerated type.

Autodesk.Revit.DB.Element.Parameter(Autodesk.Revit.DB.Definition)
Retrieves a parameter from the element based on its definition.
definition: The internal or external definition of the parameter.
Remarks: Parameters are a generic form of data storage within elements. The parameters are visible
through the Autodesk Revit user interface in the Element Properties dialog. An element can only
have one instance of a parameter with a specific definition. By using this method you can retrieve that parameter based on definition.

Autodesk.Revit.DB.Element.Parameter(System.Guid)
Retrieves a parameter from the element given an identifier.
Retrieves a parameter from the element given a GUID for a shared parameter.
guid: The unique id associated with the shared parameter.
Remarks: Parameters are a generic form of data storage within elements. The parameters are visible
through the Autodesk Revit user interface in the Element Properties dialog. This method is used to
retrieve a parameter for a known shared parameter. When a shared parameter is created it is
assigned a Guid which will not change. This guid can be used to retrieve the piece of data from the
element at a later time.

Autodesk.Revit.DB.Element.Category
Retrieves a Category object that represents the category or sub category in which the
element resides.
Remarks: All category objects can be retrieved from the application by using the Categories property
of the Application.Settings object.

Autodesk.Revit.DB.Element.Name
A human readable name for the Element.
Remarks: The Name property is a human readable name for the element, such as Wall.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the name of the element cannot be changed.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the element requires a unique name and a non-unique name is set.

Autodesk.Revit.DB.Element
Base class for most persistent data within a Revit document.
Remarks:
The data in a Revit document consists primarily of a collection of
elements.  An element usually corresponds to a single component of a
building or drawing, such as a wall, door, or dimension, but it can
also be something more abstract, like a wall type or a view.
Every element in a document has a unique ID, represented by the
ElementId class.